[
  {
    "id": "f60809e59e27f4ef1b184ee0a165c56ebd68d5578d7f6a6af67dee4025a48fcb",
    "title": "How to make a mint",
    "content": "https://xcryptography.replit.app/",
    "date": "2024-09-25T01:30:28.507Z"
  },
  {
    "id": "f3b8b7d68326dd9d76f5dcad6fc066c0ed0b17e88be191d1277c31161a7b2625",
    "title": "Consensus 2024 Reflection",
    "content": "The Consensus 2024 conference hosted by @Coindesk offered many valuable learning opportunities for me in the DeFi space. During my stay at the @VaraNetwork Hacker House, I had the opportunity to learn from the Vara team- Adam and Luis about their impactful work. Furthermore, I met many like-minded students and found a broader technical community for the first time. Throughout the week, I spent most of my time listening to regulators and policymakers to further my understanding of the outsider’s perspective.\n\nThe insights I gained from the conference reinforced my belief that DeFi must cater to a new target audience—TradFi professionals. It was encouraging to see regulators beginning to appreciate the potential of tokenization and blockchain technology. This shift represents a critical inflection point, underscoring the need for the industry to bring more novel, user-friendly, solutions to the market. My favorite part of Consensus was experiencing the diverse perspectives and stages of crypto adoption on a global scale.\n\nAs a Duke University student, I am constantly inspired by our institution's dedication to fostering rigorous debate and pioneering innovations in DeFi. A prime example of this commitment is the Digital Assets at Duke (DA@D) conference, which I attended this past January. This event assembled industry leaders, regulatory experts, and researchers for two days filled with intensive discussions and educational opportunities. It promoted a culture of productive debate which has had a profound impact on my understanding of the industry.\n\nI would like to thank Gear Foundation and the broader Vara community for their support during my time at Consensus 2024. Staying at Vara’s Hacker House provided an invaluable learning experience and the opportunity to connect with key figures in the industry. Their support made my participation in the conference both enriching and impactful.",
    "date": "2024-06-25T00:15:46.247Z"
  },
  {
    "id": "9fa1d40dafb3f3c2cb21643f232e0f1d72ab7fb327578e211ef95bcb0df8b550",
    "title": "Tokenizing Real-World Assets with XFT Global Markets",
    "content": "<p>The biggest challenge in tokenizing real-world assets (\"RWAs\") is liquidity fragmentation.</p>\n        <p>For years, the RWA space was focused on tokenizing illiquid assets like newly originated private credit (e.g., uncollateralized loans to crypto market makers). While there may have been some value in providing direct access to these opportunities for stablecoin holders, the tokenization of the loans itself served little purpose. These assets are mostly buy-and-hold; they are too bespoke and hard to price for deep secondary markets to emerge, both on- and off-chain. Given the lack of secondary market liquidity, these assets don't make great collateral for on-chain lending, derivatives, or other protocols.</p>\n        <p>So, what is next? BCG predicts $16 trillion in diverse financial assets coming on-chain in the next decade. Many have been wondering which of those assets we will focus on beyond cash equivalents. In this post, we will unveil some of those plans. Specifically, rather than issuing tokens as distinct financial assets, XFT Global Markets will treat public blockchain tokens as a messaging system through which regulated broker-dealers and custodians will accept trade and settlement instructions.</p>\n        <p>For example, USDX tokens represent ownership in a new fund XFT set up, XFT I LP, which invests in the iShares Short Treasury Bond ETF (SHV). The problem with this approach is that it fragments liquidity. For example, while a USDX holder can redeem on any given day, they cannot sell USDX during market hours into bids on Nasdaq for SHV, since USDX and SHV are distinct financial assets. This fragmentation is made worse by the slow settlement times in traditional finance. If an investor wants to redeem USDX, ordinarily, we have to sell SHV shares, wait two days for cash to settle, convert USD to USDC, and then service the redemption. Of course, we work with market makers who are willing and able to buy USDX 24/7 at some price, knowing they can turn around and redeem for cash. We also offer T+0 redemptions at up to $100M. Still, these solutions come at some cost as they require having extra cash sitting around.</p>\n        <strong>Cash Equivalents vs Everything Else</strong>\n        <p>For cash equivalents like USDX that seek to be substitutes for stablecoins, I think this cost is worth paying. Stablecoins have shown clear market demand to be able to transact 24/7. Additionally, creating USDX as a new financial asset allowed us to create it in a way where it could be held by investors who don't have to directly onboard with the trading platform, specifically by making it a bearer asset. This allows USDX to function as a yield-bearing substitute for conventional stablecoins.</p>\n        <p>However, there is little demonstrated demand to be able to trade or settle 24/7 for most financial assets, and there is a material cost in recreating liquidity for tokenized assets that is largely duplicative with the liquidity for the assets that back them. We do not think that it would be advisable, for instance, to create a fund that invests in TSLA and then to tokenize ownership in that fund and then endeavor to create secondary market liquidity in those tokens with the help of arbitrageurs. We have a better solution.</p>\n        <p>Ultimately, for most financial assets other than cash equivalents, we believe that on-chain investors and application developers simply want a way to submit trade and settlement instructions via smart contracts to traditional market intermediaries (e.g., broker dealers, who can then submit instructions to exchanges). We are excited to unveil XFT Global Markets to help bring this solution to the on-chain economy.</p>\n        <strong>Introducing XFT Global Markets</strong>\n        <p>XFT Global Markets (\"XFT GM\") will provide native access to traditional securities and associated exchange liquidity for on-chain investors and protocol developers.</p>\n        <p>XFT GM is a platform that will include an introducing broker-dealer with accounts at traditional trading, clearing, and settlement venues that will, in addition to accepting client orders via API and web app, also accept orders via smart contract call and/or token transfer. Permissions for clients to be able to make those orders will be granted as blockchain tokens (analogous to API keys).</p>\n        <strong>Example Workflows</strong>\n        <p>Let us illustrate with an example to better understand how XFT GM will treat tokens. When a client purchases a security at XFT GM, she will be given a token. For instance, consider Alice, a client of XFT GM, who wishes to purchase TSLA (Tesla Inc) stock. Alice can fund her account with stablecoins or fiat and then instruct XFT GM—via smart contract call, API, or web app—to purchase TSLA. XFT GM will promptly purchase TSLA at Nasdaq and hold the shares in its broker-dealer's account (ultimately at the DTC). In return, Alice will receive TSLA tokens (xTSLA) with transfer restrictions that limit transfer to addresses associated with other XFT GM clients.</p>\n        <p>Alice could send her xTSLA tokens to someone else who is also a client of XFT GM, and XFT GM would observe that token transfer and treat it as authoritative settlement instructions to initiate an intra-broker-dealer transfer of shares (i.e. within the authoritative books and record of XFT GM's broker-dealer).</p>\n        <p>This practice of using the blockchain as a messaging system for otherwise centralized and regulated businesses is not dissimilar to how Silvergate and Signature treated blockchain messages on SEN and Signet, respectively, as authoritative instructions to initiate balance transfers between different users with accounts at the same bank. In the context of XFT GM, the assets that can be moved are public securities rather than bank deposit balances. Additionally, XFT GM will use tokens on public blockchain networks with transfer restrictions (whereas SEN and Signet were permissioned), and token holders will be able to use smart contracts for automation and other purposes.</p>\n        <p>As a practical example of how smart contracts could be used, imagine that Alice pledges her xTSLA as collateral in a smart contract that facilitates lending agreements. If Alice fails to repay a loan mediated by the smart contract, the contract could automatically trigger a burning of the xTSLA, which XFT GM would observe and treat as authoritative instructions to sell TSLA and remit stablecoin to the smart contract, allowing the lender to be repaid. This sale of TSLA would be treated no differently than one submitted via API or web app and would ultimately be routed to a conventional exchange (e.g. Nasdaq) then later cleared and settled on conventional infrastructure (e.g. NSCC, DTC).</p>\n        <p>Importantly, xTSLA would not represent a distinct financial asset with distinct liquidity needs from TSLA shares at XFT GM. Rather, xTSLA would represent rights to TSLA as held at XFT GM's broker-dealer and the ability to direct the broker-dealer to trade, settlement, or other instructions. We call this \"Directive Tokenization\".</p>\n        <strong>Example Use Cases</strong>\n        <p>The ability to execute buy, sell, and transfer orders in public securities using public market liquidity via smart contract calls and token transfers unlocks a new world of use cases and will represent a dramatic acceleration towards bridging the composability, transparency, and efficiency of public blockchains with the traditional financial system</p>\n        <p>As a couple of examples, consider:</p>\n        <ul>\n            <li>\n                <strong>Prime brokerage for crypto plus securities:</strong>\n                Prime brokerage includes the ability to get leverage on assets held by a variety of different custodians. This is generally inaccessible to retail users today, whose only option is margin leverage from a single brokerage who holds their securities. XFT GM would make it possible for third parties to provide lending arrangements that could easily collateralize loans by securities at a variety of different custodians. You can imagine similar financial products like derivatives (e.g. perps) cross-collateralized by crypto and securities held at different custodians.\n            </li>\n            <br><li>\n                <strong>Tokenized funds backed by token-powered securities:</strong>\n                If you are an asset manager creating funds – similar to USDX, or even an actively managed basket of securities – and you want to be able to accept subscription and redemption requests with stablecoins, we can make that easier for you. XFT GM can be funded directly with stablecoins, and redemption requests can be authoritatively requested via contract calls. This is the infrastructure we created to connect USDX to traditional brokerages that doesn't need to be re-created for every new fund manager with onchain investors.\n            </li>\n        </ul>\n        <strong>Comparisons</strong>\n        <p>XFT GM will combine the asset and liquidity access and institutional-grade investor protections of traditional brokerages with the on-chain interoperability, composability, and low-friction settlement of public blockchains. We highlight below the various facets of XFT GM's value proposition versus conventional brokerages and existing tokenized securities on public blockchains.</p>\n        <p><strong>XFT GM vs Traditional Brokerages (e.g., Goldman, Robinhood, Apex Clearing):</strong></p>\n        <ul>\n            <li>Compatibility with smart contracts (and thus on-chain lending, trading, derivative, etc. protocols)</li>\n            <li>Distribution and settlement on the same rails as crypto assets (appeals to crypto-native businesses like exchanges and users)</li>\n            <li>24/7 settlement when needed</li>\n        </ul>\n        <p><strong>XFT GM vs Existing Tokenized Securities:</strong></p>\n        <ul>\n            <li>Access to public securities and traditional liquidity venues (e.g., NYSE)</li>\n            <li>No requirement or cost to create new on-chain liquidity, custody, etc. for tokenized securities</li>\n            <li>Scales to thousands of liquid public securities</li>\n        </ul>\n        <p>To realize the promise of blockchains to create a fairer, open, and transparent financial system, it is paramount that we create infrastructure that is compatible and interoperable with both public blockchain networks and protocols as well as traditional trading, clearing, and settlement systems for regulated markets. We are creating XFT GM to achieve this mission and unlock access to and liquidity from public regulated securities for on-chain builders and investors.</p>",
    "date": "2024-02-25T00:56:34.472Z"
  }
]